Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/shijing__xiaoya-luming-003__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 皇皇者華，于彼原隰。駪駪征夫，每懷靡及。
en: Brilliant are the flowers, On those level heights and the low grounds. Complete and alert is the messenger, with his suite, Ever anxious lest he should not succeed.

source: 我馬維駒，六轡如濡。載馳載驅，周爰咨諏。
en: My horses are young; The six reins look as if they were moistened. I gallop them, and urge them on, Everywhere pushing my inquiries.

source: 我馬維騏，六轡如絲。載馳載驅，周爰咨謀。
en: My horses are piebald; The six reins are like silk. I gallop them, and urge them on, Everywhere seeking information and counsel.

source: 我馬維駱，六轡沃若。載馳載驅，周爰咨度。
en: My horses are white and black-maned; The six reins look glossy. I gallop them and urge them on, Everywhere seeking information and advice.

source: 我馬維駰，六轡既均。載馳載驅，周爰咨詢。
en: My horses are grey; The six reins are well in hand. I gallop them and urge them on, Everywhere seeking information and suggestions.
